app/controllers/comments_controller.rb

def create
	@post = Post.find(params[:post_id])
	 @comment.create_activity :create, owner: current_user
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
INSERT INTO "activities" ("trackable_type", "trackable_id", "owner_type", "owner_id", "key", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "comments" ("name", "body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "bm"], ["body", "nm"], ["post_id", 7], ["created_at", "2017-12-18 05:57:59.821304"], ["updated_at", "2017-12-18 05:57:59.821304"]]