app/controllers/posts_controller.rb

INSERT INTO "posts" ("attachment", "context", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["attachment", "head.png"], ["context", "comments"], ["user_id", 1], ["created_at", "2017-12-18 06:02:41.721868"], ["updated_at", "2017-12-18 06:02:41.721868"]]
---
  def create
    @post = Post.new(post_params) do |post|
      post.user = current_user
    end

    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
def upvote
  @post = Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
def downvote
  @post = Post.find(params[:id])